sample_data/sample_xmlfiles/GetPassengerListRQ_v4_SamplePayload_4_2_c.xml

<SamplePayloads>
	<!--Request-->
	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v4="http://services.sabre.com/checkin/getPassengerList/v4">
	<soapenv:Header>
		<sec:Security>
			<sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSA!ICESMSLB\/STS.LB!-3218513568092758902!341744!0</sec:BinarySecurityToken>
		</sec:Security>
		<mes:MessageHeader>
			<mes:From>
				<mes:PartyId mes:type="urn:x12.org:IO5:01">999999</mes:PartyId>
			</mes:From>
			<mes:To>
				<mes:PartyId mes:type="urn:x12.org:IO5:01">123123</mes:PartyId>
			</mes:To>
			<mes:ConversationId>99999999</mes:ConversationId>
			<mes:Service mes:type="string"/>
			<mes:Action>GetPassengerListRQ</mes:Action>
		</mes:MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<v4:GetPassengerListRQ version="4.0.0" timeStamp="2017-07-14T09:30:47Z" messageID="17867654537556" serviceOption="Stateless">
			<v4:Itinerary>
				<v4:Airline>EY</v4:Airline>
				<v4:Flight>888</v4:Flight>
				<v4:DepartureDate>2017-10-25</v4:DepartureDate>
				<v4:Origin>AUH</v4:Origin>				
			</v4:Itinerary>
			<v4:DisplayCodeRequest>
				<v4:DisplayCodes >
						<v4:DisplayCode>P</v4:DisplayCode>
				</v4:DisplayCodes>
				
			</v4:DisplayCodeRequest>

		</v4:GetPassengerListRQ>
	</soapenv:Body>
</soapenv:Envelope>

<!--RESPONSE-->

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
   <soap-env:Header>
      <eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="urn:x12.org:IO5:01">123123</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="urn:x12.org:IO5:01">999999</eb:PartyId>
         </eb:To>
         <eb:ConversationId>99999999</eb:ConversationId>
         <eb:Service eb:type="string"/>
         <eb:Action>GetPassengerListRQ</eb:Action>
         <eb:MessageData>
            <eb:MessageId>1591489377139210610</eb:MessageId>
            <eb:Timestamp>2017-10-24T10:28:34</eb:Timestamp>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSA!ICESMSLB\/STS.LB!-3218513568092758902!341744!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <GetPassengerListRS version="4.0.0" timeStamp="2017-10-24T10:28:34.669Z" messageID="17867654537556" xmlns="http://services.sabre.com/checkin/getPassengerList/v4" xmlns:ns2="http://services.sabre.com/STL/v3">
         <ItineraryInfo>
            <Itinerary>
               <Airline>EY</Airline>
               <Flight>888</Flight>
               <DepartureDate>2017-10-25</DepartureDate>
               <Origin>AUH</Origin>
               <AircraftType>789</AircraftType>
            </Itinerary>
            <DepartureArrival_Dates>
               <Scheduled_DepartureDate>2017-10-25</Scheduled_DepartureDate>
               <Estimated_DepartureDate>2017-10-25</Estimated_DepartureDate>
               <DepartureTime>09:30PM</DepartureTime>
            </DepartureArrival_Dates>
            <DepartureGate>GATE</DepartureGate>
            <CabinInfoList>
               <ns2:CabinInfo>
                  <ns2:Destination>PEK</ns2:Destination>
                  <ns2:Cabin>J</ns2:Cabin>
                  <ns2:Authorized>028</ns2:Authorized>
                  <ns2:Available>027</ns2:Available>
               </ns2:CabinInfo>
               <ns2:CabinInfo>
                  <ns2:Destination>PEK</ns2:Destination>
                  <ns2:Cabin>Y</ns2:Cabin>
                  <ns2:Authorized>271</ns2:Authorized>
                  <ns2:Available>271</ns2:Available>
               </ns2:CabinInfo>
            </CabinInfoList>
         </ItineraryInfo>
         <PassengerInfoList>
            <PassengerInfo>
               <Name_Details>
                  <LastName>KRISHNANA</LastName>
                  <FirstName>PATIL</FirstName>
               </Name_Details>
               <PassengerID>16391D2C0001</PassengerID>
               <LineNumber>1</LineNumber>
               <PriorityCode>UPG</PriorityCode>
               <BookingClass>Y</BookingClass>
               <Destination>NGO</Destination>
               <BoardingPassFlag>false</BoardingPassFlag>
               <BagCount>NB</BagCount>
               <Indicators>
                  <Indicator>NotBoarded</Indicator>
               </Indicators>
               <CheckIn_Info>
                  <CheckInStatus>false</CheckInStatus>
               </CheckIn_Info>
               <Boarding_Info>
                  <BoardStatus>false</BoardStatus>
               </Boarding_Info>
            </PassengerInfo>
            <PassengerInfo>
               <Name_Details>
                  <LastName>MIKE</LastName>
                  <FirstName>TURNE</FirstName>
               </Name_Details>
               <PassengerID>16391CF00001</PassengerID>
               <LineNumber>2</LineNumber>
               <PriorityCode>UPG</PriorityCode>
               <BookingClass>Y</BookingClass>
               <DesiredBookingClass>F</DesiredBookingClass>
               <Destination>NGO</Destination>
               <BoardingPassFlag>false</BoardingPassFlag>
               <BagCount>NB</BagCount>
               <Indicators>
                  <Indicator>NotBoarded</Indicator>
               </Indicators>
               <CheckIn_Info>
                  <CheckInStatus>false</CheckInStatus>
               </CheckIn_Info>
               <Boarding_Info>
                  <BoardStatus>false</BoardStatus>
               </Boarding_Info>
            </PassengerInfo>
            <PassengerInfo>
               <Name_Details>
                  <LastName>NIKE</LastName>
                  <FirstName>JAKEN</FirstName>
               </Name_Details>
               <PassengerID>163943DC0001</PassengerID>
               <LineNumber>3</LineNumber>
               <PriorityCode>UPG</PriorityCode>
               <CorpID>T</CorpID>
               <BookingClass>Y</BookingClass>
               <DesiredBookingClass>J</DesiredBookingClass>
               <Destination>NGO</Destination>
               <BoardingPassFlag>false</BoardingPassFlag>
               <BagCount>NB</BagCount>
               <Indicators>
                  <Indicator>NotBoarded</Indicator>
               </Indicators>
               <CheckIn_Info>
                  <CheckInStatus>false</CheckInStatus>
               </CheckIn_Info>
               <Boarding_Info>
                  <BoardStatus>false</BoardStatus>
               </Boarding_Info>
            </PassengerInfo>
            <PassengerInfo>
               <Name_Details>
                  <LastName>MILLER</LastName>
                  <FirstName>DANIE</FirstName>
               </Name_Details>
               <PassengerID>16391D800001</PassengerID>
               <LineNumber>4</LineNumber>
               <PriorityCode>B01</PriorityCode>
               <BookingClass>Y</BookingClass>
               <Destination>NGO</Destination>
               <BoardingPassFlag>false</BoardingPassFlag>
               <BagCount>NB</BagCount>
               <SeniorityDate>1977-06-21</SeniorityDate>
               <Indicators>
                  <Indicator>NotBoarded</Indicator>
               </Indicators>
               <CheckIn_Info>
                  <CheckInStatus>false</CheckInStatus>
               </CheckIn_Info>
               <Boarding_Info>
                  <BoardStatus>false</BoardStatus>
               </Boarding_Info>
            </PassengerInfo>
            <PassengerInfo>
               <Name_Details>
                  <LastName>PARKER</LastName>
                  <FirstName>JIM</FirstName>
               </Name_Details>
               <PassengerID>16391D4A0001</PassengerID>
               <LineNumber>5</LineNumber>
               <PriorityCode>B01</PriorityCode>
               <BookingClass>Y</BookingClass>
               <Destination>NGO</Destination>
               <BoardingPassFlag>false</BoardingPassFlag>
               <BagCount>NB</BagCount>
               <SeniorityDate>1977-06-21</SeniorityDate>
               <Indicators>
                  <Indicator>NotBoarded</Indicator>
               </Indicators>
               <CheckIn_Info>
                  <CheckInStatus>false</CheckInStatus>
               </CheckIn_Info>
               <Boarding_Info>
                  <BoardStatus>false</BoardStatus>
               </Boarding_Info>
            </PassengerInfo>
         </PassengerInfoList>
         <Result timeStamp="2017-10-24T10:28:34.669Z">
            <ns2:Status>Success</ns2:Status>
            <ns2:CompletionStatus>Complete</ns2:CompletionStatus>
            <ns2:System>CKI-WS</ns2:System>
         </Result>
      </GetPassengerListRS>
   </soap-env:Body>
</soap-env:Envelope>

</SamplePayloads>